app/controllers/drivers_controller.rb

  def index
    @drivers =  Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    driver = Driver.new(driver_params)
    if driver.valid?
      driver.save
---
INSERT INTO "drivers" ("first_name", "last_name", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "John"], ["last_name", "Doe"], ["phone_number", "012345678"], ["created_at", "2019-06-26 14:12:25.127080"], ["updated_at", "2019-06-26 14:12:25.127080"]]

  def update
    @driver.update(driver_params)
---
UPDATE "drivers" SET "first_name" = ?, "last_name" = ?, "phone_number" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["first_name", "John"], ["last_name", "Doe"], ["phone_number", "01245678"], ["updated_at", "2019-06-26 14:19:29.181069"], ["id", 5]]

  def destroy
    @driver.destroy
---
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 4]]

  def set_driver
    @driver = Driver.find(params[:id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]